app/controllers/movies_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 1]]
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_file_name", "sultane.jpg"], ["image_file_size", 90468], ["image_updated_at", "2016-08-09 00:10:22.004427"], ["updated_at", "2016-08-09 00:10:22.141524"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)